[
  {
    "title": "Serbia",
    "MCC": "220",
    "Dial Code": "381",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Serbia: SMS Guidelines Serbia: SMS Guidelines MCC: 220 Dial Code: 381 Alphanumeric Sender IDs are supported with registration. Registration is possible to ensure Alphanumeric Senders can be maintained. Without registration, Alpha Senders will be overwritten to Generic Alpha Sender IDs. The registration of Alphanumeric Senders involves monthly fees. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Republic of Korea (South Korea)",
    "MCC": "450",
    "Dial Code": "82",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Republic of Korea (South Korea): SMS Guidelines Republic of Korea (South Korea): SMS Guidelines MCC: 450 Dial Code: 82 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Local Long Code to ensure delivery. All messages to this destination will have the following text added by default: [Web ë°śě‹ ] : This indicates A2P traffic [ęµ­ě śë°śě‹ ]: This indicates that the message has been sent from abroad Gambling and Adult content is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kiribati",
    "MCC": "545",
    "Dial Code": "686",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kiribati: SMS Guidelines Kiribati: SMS Guidelines MCC: 545 Dial Code: 686 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Zimbabwe",
    "MCC": "648",
    "Dial Code": "263",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Zimbabwe: SMS Guidelines Zimbabwe: SMS Guidelines MCC: 648 Dial Code: 263 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Zambia",
    "MCC": "645",
    "Dial Code": "260",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Zambia: SMS Guidelines Zambia: SMS Guidelines MCC: 645 Dial Code: 260 Alphanumeric Sender IDs are supported. For Network MTN (65402) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Yemen",
    "MCC": "421",
    "Dial Code": "998",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Yemen: SMS Guidelines MCC: 421 Dial Code: 998 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Virgin Islands (British)",
    "MCC": "348",
    "Dial Code": "1340",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Virgin Islands (British): SMS Guidelines Virgin Islands (British): SMS Guidelines MCC: 348 Dial Code: 1340 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Vietnam",
    "MCC": "452",
    "Dial Code": "84",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Vietnam: SMS Guidelines Vietnam: SMS Guidelines MCC: 452 Dial Code: 84 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Vietnam is a destination that supports SMSC-DLR only, as such positive DLRs are to be expected. Handset delivery reports are not possible. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Vanuatu",
    "MCC": "541",
    "Dial Code": "678",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Vanuatu: SMS Guidelines Vanuatu: SMS Guidelines MCC: 541 Dial Code: 678 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Uzbekistan",
    "MCC": "434",
    "Dial Code": "998",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Uzbekistan: SMS Guidelines Uzbekistan: SMS Guidelines MCC: 434 Dial Code: 998 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "United Arab Emirates",
    "MCC": "424",
    "Dial Code": "971",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "United Arab Emirates: SMS Guidelines United Arab Emirates: SMS Guidelines MCC: 424 Dial Code: 971 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. For promotional traffic, the suffix \"AD\" must be added to the Alphanumeric Sender for traffic distinction. Promotional traffic is not allowed between 09: 00 pm and 07: 00 local time, all traffic submitted during this time window will be queued and delivery will be attempted outside the time period. Religious, gambling political or adult traffic is prohibited. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Uganda",
    "MCC": "641",
    "Dial Code": "256",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Uganda: SMS Guidelines MCC: 641 Dial Code: 256 Alphanumeric Sender IDs are supported. For Network MTN (64110) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tuvalu",
    "MCC": "553",
    "Dial Code": "688",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tuvalu: SMS Guidelines Tuvalu: SMS Guidelines MCC: 553 Dial Code: 688 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turks and Caicos Islands",
    "MCC": "376",
    "Dial Code": "1649",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Turks and Caicos Islands: SMS Guidelines MCC: 376 Dial Code: 1649 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turkmenistan",
    "MCC": "438",
    "Dial Code": "993",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Turkmenistan: SMS Guidelines MCC: 438 Dial Code: 993 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Long Code or Generic Alphanumeric Sender ID to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Tunisia",
    "MCC": "605",
    "Dial Code": "216",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tunisia: SMS Guidelines Tunisia: SMS Guidelines MCC: 605 Dial Code: 216 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Trinidad & Tobago",
    "MCC": "374",
    "Dial Code": "1868",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Trinidad & Tobago: SMS Guidelines Trinidad & Tobago: SMS Guidelines MCC: 374 Dial Code: 1868 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Long Code to ensure delivery towards Network Bmobile (37412). Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Tonga",
    "MCC": "539",
    "Dial Code": "676",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tonga: SMS Guidelines Tonga: SMS Guidelines MCC: 539 Dial Code: 676 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Togo",
    "MCC": "615",
    "Dial Code": "228",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Togo: SMS Guidelines Togo: SMS Guidelines MCC: 615 Dial Code: 228 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Timor-Leste",
    "MCC": "514",
    "Dial Code": "670",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Timor-Leste: SMS Guidelines Timor-Leste: SMS Guidelines MCC: 514 Dial Code: 670 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Thailand",
    "MCC": "520",
    "Dial Code": "66",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Thailand: SMS Guidelines Thailand: SMS Guidelines MCC: 520 Dial Code: 66 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tanzania",
    "MCC": "640",
    "Dial Code": "255",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Tanzania: SMS Guidelines Tanzania: SMS Guidelines MCC: 640 Dial Code: 255 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tajikistan",
    "MCC": "436",
    "Dial Code": "992",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tajikistan: SMS Guidelines Tajikistan: SMS Guidelines MCC: 436 Dial Code: 992 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Taiwan",
    "MCC": "466",
    "Dial Code": "886",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Taiwan: SMS Guidelines Taiwan: SMS Guidelines MCC: 466 Dial Code: 886 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Local Long Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Syria",
    "MCC": "417",
    "Dial Code": "963",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Syria: SMS Guidelines MCC: 417 Dial Code: 963 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Long Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Sudan",
    "MCC": "634",
    "Dial Code": "249",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Sudan: SMS Guidelines Sudan: SMS Guidelines MCC: 634 Dial Code: 249 Alphanumeric Sender IDs are supported. For Network MTN (63402) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sri Lanka",
    "MCC": "413",
    "Dial Code": "94",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Sri Lanka: SMS Guidelines Sri Lanka: SMS Guidelines MCC: 413 Dial Code: 94 Alphanumeric Sender IDs are supported. For Networks Dialog (41302) and Mobitel (41301) Alphanumeric Sender IDs are only supported with registration. Network Mobitel (41301) only allows OTP, transactional traffic. Messages carrying non-OTP traffic will be rejected by the Network. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "South Sudan",
    "MCC": "659",
    "Dial Code": "211",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "South Sudan: SMS Guidelines South Sudan: SMS Guidelines MCC: 659 Dial Code: 211 Alphanumeric Sender IDs are supported. For Network MTN (65902) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Somalia",
    "MCC": "637",
    "Dial Code": "252",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Somalia: SMS Guidelines Somalia: SMS Guidelines MCC: 637 Dial Code: 252 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Solomon Islands",
    "MCC": "540",
    "Dial Code": "677",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Solomon Islands: SMS Guidelines Solomon Islands: SMS Guidelines MCC: 540 Dial Code: 677 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Slovakia",
    "MCC": "231",
    "Dial Code": "421",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Slovakia: SMS Guidelines Slovakia: SMS Guidelines MCC: 231 Dial Code: 421 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Singapore",
    "MCC": "525",
    "Dial Code": "65",
    "Alphanumeric": "Alphanumeric Sender IDs has been implemented by the Infocomm Media Development Authority (IMDA) since January 31st, 2023",
    "combined_text": "Singapore: SMS Guidelines MCC: 525 Dial Code: 65 Mandatory registration of Alphanumeric Sender IDs has been implemented by the Infocomm Media Development Authority (IMDA) since January 31st, 2023. From this date and until July 31st, 2023, all submissions with un-registered Alphanumeric Sender IDs will be flagged and overwritten with \"Likely-SCAM\". After July 31st, 2023, messages with un-registered Alphanumeric Sender IDs will be blocked. Kindly note that the registration of Alphanumeric Senders involves fees. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alphanumeric Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sierra Leone",
    "MCC": "619",
    "Dial Code": "232",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sierra Leone: SMS Guidelines MCC: 619 Dial Code: 232 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Seychelles",
    "MCC": "633",
    "Dial Code": "248",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Seychelles: SMS Guidelines Seychelles: SMS Guidelines MCC: 633 Dial Code: 248 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Senegal",
    "MCC": "608",
    "Dial Code": "221",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Senegal: SMS Guidelines Senegal: SMS Guidelines MCC: 608 Dial Code: 221 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saudi Arabia",
    "MCC": "420",
    "Dial Code": "966",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Saudi Arabia: SMS Guidelines Saudi Arabia: SMS Guidelines MCC: 420 Dial Code: 966 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Registration is only possible for International Brands. For promotional traffic, the suffix \"AD\" must be added to the Alphanumeric Sender for traffic distinction. If message content includes URLs, these must also be whitelisted as part of the Alphanumeric Sender ID registration process. The use of shortened URL links (bit links) is not allowed. Gambling, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sao Tome and Principe",
    "MCC": "626",
    "Dial Code": "239",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sao Tome and Principe: SMS Guidelines Sao Tome and Principe: SMS Guidelines MCC: 626 Dial Code: 239 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "San Marino",
    "MCC": "292",
    "Dial Code": "378",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "San Marino: SMS Guidelines San Marino: SMS Guidelines MCC: 292 Dial Code: 378 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Samoa",
    "MCC": "549",
    "Dial Code": "685",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Samoa: SMS Guidelines Samoa: SMS Guidelines MCC: 549 Dial Code: 685 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Vincent and the Grenadines",
    "MCC": "360",
    "Dial Code": "1784",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Vincent and the Grenadines: SMS Guidelines Saint Vincent and the Grenadines: SMS Guidelines MCC: 360 Dial Code: 1784 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Pierre and Miquelon",
    "MCC": "308",
    "Dial Code": "508",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Pierre and Miquelon: SMS Guidelines Saint Pierre and Miquelon: SMS Guidelines MCC: 308 Dial Code: 508 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Lucia",
    "MCC": "358",
    "Dial Code": "1758",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Lucia: SMS Guidelines Saint Lucia: SMS Guidelines MCC: 358 Dial Code: 1758 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Kitts & Nevis",
    "MCC": "356",
    "Dial Code": "1869",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Kitts & Nevis: SMS Guidelines MCC: 356 Dial Code: 1869 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Rwanda",
    "MCC": "635",
    "Dial Code": "250",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Rwanda: SMS Guidelines Rwanda: SMS Guidelines MCC: 635 Dial Code: 250 Alphanumeric Sender IDs are supported. For Network MTN (63510) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Reunion",
    "MCC": "647",
    "Dial Code": "262",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Reunion: SMS Guidelines Reunion: SMS Guidelines MCC: 647 Dial Code: 262 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Qatar",
    "MCC": "427",
    "Dial Code": "974",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Qatar: SMS Guidelines Qatar: SMS Guidelines MCC: 427 Dial Code: 974 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Papua New Guinea",
    "MCC": "537",
    "Dial Code": "675",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Papua New Guinea: SMS Guidelines Papua New Guinea: SMS Guidelines MCC: 537 Dial Code: 675 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Palestinian Territory",
    "MCC": "425",
    "Dial Code": "970",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Palestinian Territory: SMS Guidelines MCC: 425 Dial Code: 970 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Personal Loans, gambling, adult and cryptocurrency related traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Palau",
    "MCC": "552",
    "Dial Code": "680",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Palau: SMS Guidelines MCC: 552 Dial Code: 680 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Pakistan",
    "MCC": "410",
    "Dial Code": "92",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Pakistan: SMS Guidelines Pakistan: SMS Guidelines MCC: 410 Dial Code: 92 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Gambling related traffic is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Oman",
    "MCC": "422",
    "Dial Code": "968",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Oman: SMS Guidelines Oman: SMS Guidelines MCC: 422 Dial Code: 968 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Non-registered Alpha Sender IDs will either be rejected or overwritten. However this is on best-effort basis. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Norfolk Island",
    "MCC": "505",
    "Dial Code": "672",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Norfolk Island: SMS Guidelines Norfolk Island: SMS Guidelines MCC: 505 Dial Code: 672 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nigeria",
    "MCC": "621",
    "Dial Code": "234",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Nigeria: SMS Guidelines Nigeria: SMS Guidelines MCC: 621 Dial Code: 234 Alphanumeric Sender IDs are supported. For Network MTN (62130) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Niger",
    "MCC": "614",
    "Dial Code": "227",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Niger: SMS Guidelines Niger: SMS Guidelines MCC: 614 Dial Code: 227 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "New Zealand",
    "MCC": "530",
    "Dial Code": "64",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "New Zealand: SMS Guidelines New Zealand: SMS Guidelines MCC: 530 Dial Code: 64 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Short Code to ensure delivery. Due to local restrictions, dedicated short codes are the best way to improve delivery towards this destination. Without a dedicated short code, message delivery is to be considered as best-effort delivery only. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "New Caledonia",
    "MCC": "546",
    "Dial Code": "687",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "New Caledonia: SMS Guidelines New Caledonia: SMS Guidelines MCC: 546 Dial Code: 687 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Netherlands Antilles",
    "MCC": "362",
    "Dial Code": "599",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Netherlands Antilles: SMS Guidelines Netherlands Antilles: SMS Guidelines MCC: 362 Dial Code: 599 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nepal",
    "MCC": "429",
    "Dial Code": "977",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Nepal: SMS Guidelines Nepal: SMS Guidelines Nepal: SMS Guidelines MCC: 429 Dial Code: 977 Alphanumeric Sender IDs are supported. For Network Ncell (42902) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Namibia",
    "MCC": "649",
    "Dial Code": "264",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Namibia: SMS Guidelines MCC: 649 Dial Code: 264 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Occasionally Alphanumeric Sender IDs might be replaced by Generic Alphanumeric Sender ID to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Myanmar",
    "MCC": "414",
    "Dial Code": "95",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Myanmar: SMS Guidelines MCC: 414 Dial Code: 95 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Mozambique",
    "MCC": "643",
    "Dial Code": "258",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Mozambique: SMS Guidelines MCC: 643 Dial Code: 258 Alphanumeric Sender IDs are supported. Occasionally Alpha Sender ID might be replaced by Generic Alpha Sender ID towards Network Movitel (64303) to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Morocco",
    "MCC": "604",
    "Dial Code": "212",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Morocco: SMS Guidelines Morocco: SMS Guidelines MCC: 604 Dial Code: 212 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Montserrat",
    "MCC": "354",
    "Dial Code": "1664",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Montserrat: SMS Guidelines MCC: 354 Dial Code: 1664 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Montenegro",
    "MCC": "297",
    "Dial Code": "382",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Montenegro: SMS Guidelines Montenegro: SMS Guidelines MCC: 297 Dial Code: 382 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mongolia",
    "MCC": "428",
    "Dial Code": "976",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Mongolia: SMS Guidelines MCC: 428 Dial Code: 976 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Monaco",
    "MCC": "212",
    "Dial Code": "377",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Monaco: SMS Guidelines MCC: 212 Dial Code: 377 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mauritius",
    "MCC": "617",
    "Dial Code": "230",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, except towards network Orange Mauritius",
    "combined_text": "Mauritius: SMS Guidelines MCC: 617 Dial Code: 230 Alphanumeric Sender IDs are supported and will be maintained, except towards network Orange Mauritius. No registration is required. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mauritania",
    "MCC": "609",
    "Dial Code": "222",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Mauritania: SMS Guidelines MCC: 609 Dial Code: 222 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Martinique",
    "MCC": "340",
    "Dial Code": "596",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Martinique: SMS Guidelines Martinique: SMS Guidelines MCC: 340 Dial Code: 596 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malta",
    "MCC": "278",
    "Dial Code": "356",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Malta: SMS Guidelines Malta: SMS Guidelines MCC: 278 Dial Code: 356 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mali",
    "MCC": "610",
    "Dial Code": "223",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Mali: SMS Guidelines Mali: SMS Guidelines MCC: 610 Dial Code: 223 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Maldives",
    "MCC": "472",
    "Dial Code": "960",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Maldives: SMS Guidelines Maldives: SMS Guidelines MCC : 472 Dial Code: 960 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malaysia",
    "MCC": "502",
    "Dial Code": "60",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Malaysia: SMS Guidelines Malaysia: SMS Guidelines MCC: 502 Dial Code: 60 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Message content should start with the Header â€śRM0.00 ,â€ť â€śRM0.0 ,â€ť or â€śRM0 â€ś. If this header is not included, it will be added by local operators, this can disrupt total message content length. Additionally, content should include a brand/identifier or company name, without this identifier, operators can filter traffic or impose fines for non-compliant traffic. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malawi",
    "MCC": "650",
    "Dial Code": "265",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Malawi: SMS Guidelines Malawi: SMS Guidelines MCC: 650 Dial Code: 265 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Madagascar",
    "MCC": "646",
    "Dial Code": "261",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Madagascar: SMS Guidelines MCC: 646 Dial Code: 261 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Macedonia (North Macedonia)",
    "MCC": "294",
    "Dial Code": "389",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Macedonia (North Macedonia): SMS Guidelines Macedonia (North Macedonia): SMS Guidelines MCC: 294 Dial Code: 389 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Occasionally Alphanumeric Sender IDs might be replaced by Generic Alphanumeric Sender ID to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Macao",
    "MCC": "455",
    "Dial Code": "853",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Macao: SMS Guidelines Macao: SMS Guidelines MCC: 455 Dial Code: 853 Alphanumeric Sender IDs are supported. Registration is not necessary. Alphanumeric Sender IDs can be overwritten to a random Hong Kong Long Code to ensure delivery towards Network China Telecom (45507). There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Liechtenstein",
    "MCC": "295",
    "Dial Code": "423",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Liechtenstein: SMS Guidelines Liechtenstein: SMS Guidelines MCC: 295 Dial Code: 423 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Libya",
    "MCC": "606",
    "Dial Code": "218",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Libya: SMS Guidelines Libya: SMS Guidelines MCC: 606 Dial Code: 218 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Liberia",
    "MCC": "618",
    "Dial Code": "231",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Liberia: SMS Guidelines Liberia: SMS Guidelines MCC: 618 Dial Code: 231 Alphanumeric Sender IDs are supported. For Network Lonestar MTN (61801) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Lesotho",
    "MCC": "651",
    "Dial Code": "266",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lesotho: SMS Guidelines Lesotho: SMS Guidelines MCC: 651 Dial Code: 266 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Lebanon",
    "MCC": "415",
    "Dial Code": "961",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lebanon: SMS Guidelines Lebanon: SMS Guidelines MCC: 415 Dial Code: 961 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Laos PDR",
    "MCC": "457",
    "Dial Code": "856",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Laos PDR: SMS Guidelines MCC: 457 Dial Code: 856 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kyrgyzstan",
    "MCC": "437",
    "Dial Code": "996",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kyrgyzstan: SMS Guidelines MCC: 437 Dial Code: 996 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kuwait",
    "MCC": "419",
    "Dial Code": "965",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kuwait: SMS Guidelines Kuwait: SMS Guidelines MCC: 419 Dial Code: 965 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Adult, religious and political content is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Kosovo",
    "MCC": "221",
    "Dial Code": "383",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kosovo: SMS Guidelines Kosovo: SMS Guidelines MCC: 221 Dial Code: 383 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kenya",
    "MCC": "639",
    "Dial Code": "254",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kenya: SMS Guidelines Kenya: SMS Guidelines MCC: 639 Dial Code: 254 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Political, Religious, gambling, adult and P2P content is prohibited. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Kazakhstan",
    "MCC": "401",
    "Dial Code": "7",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kazakhstan: SMS Guidelines Kazakhstan: SMS Guidelines MCC: 401 Dial Code: 7 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Non-registered Alphanumeric Sender IDs will either be rejected or overwritten. However, this is on best-effort basis. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Jordan",
    "MCC": "416",
    "Dial Code": "962",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Jordan: SMS Guidelines Jordan: SMS Guidelines MCC: 416 Dial Code: 962 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Promotional traffic can only be sent between 7 A.M. and 9 P.M. local time. Alphanumeric Senders used for promotional traffic must include the prefix \"ADV\". Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Japan",
    "MCC": "440",
    "Dial Code": "81",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Japan: SMS Guidelines Japan: SMS Guidelines MCC: 440 Dial Code: 81 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. SMS containing URLs as part of the message body could be filtered Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Jamaica",
    "MCC": "338",
    "Dial Code": "1876",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Jamaica: SMS Guidelines Jamaica: SMS Guidelines MCC: 338 Dial Code: 1876 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Israel",
    "MCC": "425",
    "Dial Code": "972",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Israel: SMS Guidelines Israel: SMS Guidelines MCC: 425 Dial Code: 972 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Religious, gambling, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iran",
    "MCC": "432",
    "Dial Code": "98",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Iran: SMS Guidelines Iran: SMS Guidelines MCC: 432 Dial Code: 98 Alphanumeric Sender IDs are partially supported. For network Righttel (43220), Alphanumeric Sender IDs are supported and will be maintained Alphanumeric Sender ID registration is required for Network MCI (43211). For the remaining networks Alphanumeric Senders will be overwritten to a random long code to ensure delivery. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Indonesia",
    "MCC": "510",
    "Dial Code": "62",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Indonesia: SMS Guidelines MCC: 510 Dial Code: 62 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Unregistered Alphanumeric Sender IDs can sometimes be overwritten, however this should only be seen as best-effort delivery. There is a distinction between Local and International traffic and processes vary depending on this difference. The use of generic Alphanumeric Sender IDs is not recommended. Alphanumeric Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "India",
    "MCC": "404",
    "Dial Code": "91",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported through registration",
    "combined_text": "India: SMS Guidelines MCC: 404 - 405 Dial Code: 91 Alphanumeric Sender IDs are partially supported through registration. Only Local Alpha Sender IDs (Local Entities) can be registered (DLT registration process) while no registration is possible for International Alpha Sender IDs. International Alphanumeric Sender IDs will be overwritten to random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Hong Kong",
    "MCC": "454",
    "Dial Code": "852",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Hong Kong: SMS Guidelines Hong Kong: SMS Guidelines MCC: 454 Dial Code: 852 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. It is common for handsets in Hong Kong to follow the â€ś2 numbers 1 SIM Cardâ€ť model, with one Chinese number (+86) and one HK number (+85), this can cause delivery issues. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Haiti",
    "MCC": "372",
    "Dial Code": "509",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Haiti: SMS Guidelines Haiti: SMS Guidelines MCC: 372 Dial Code: 509 Alphanumeric Sender IDs are partially supported. Registration is not possible. Alphanumeric Sender IDs are not supported towards Operator Natcom (37203), due to local restrictions, submissions with this type of Sender will be blocked. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guyana",
    "MCC": "738",
    "Dial Code": "592",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Guyana: SMS Guidelines Guyana: SMS Guidelines MCC: 738 Dial Code: 592 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guinea-Bissau",
    "MCC": "632",
    "Dial Code": "245",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Guinea-Bissau: SMS Guidelines Guinea-Bissau: SMS Guidelines MCC: 632 Dial Code: 245 Alphanumeric Sender IDs are supported. For Network MTN (63202) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Guinea",
    "MCC": "611",
    "Dial Code": "224",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Guinea: SMS Guidelines Guinea: SMS Guidelines MCC: 611 Dial Code: 224 Alphanumeric Sender IDs are supported. For Network MTN (61104) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Guam",
    "MCC": "310",
    "Dial Code": "1671",
    "Alphanumeric": "Alphanumeric Sender IDs is not allowed/supported for this destination",
    "combined_text": "Guam: SMS Guidelines Guam: SMS Guidelines MCC: 310 Dial Code: 1671 The use of Alphanumeric Sender IDs is not allowed/supported for this destination. For this destination, only traffic with Long Code is permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guadeloupe",
    "MCC": "340",
    "Dial Code": "590",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Guadeloupe: SMS Guidelines Guadeloupe: SMS Guidelines MCC: 340 Dial Code: 590 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Grenada",
    "MCC": "352",
    "Dial Code": "1473",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Grenada: SMS Guidelines Grenada: SMS Guidelines MCC: 352 Dial Code: 1473 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Greenland",
    "MCC": "290",
    "Dial Code": "299",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Greenland: SMS Guidelines MCC: 290 Dial Code: 299 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gibraltar",
    "MCC": "266",
    "Dial Code": "350",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gibraltar: SMS Guidelines Gibraltar: SMS Guidelines MCC: 266 Dial Code: 350 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ghana",
    "MCC": "620",
    "Dial Code": "233",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Ghana: SMS Guidelines MCC: 620 Dial Code: 233 Alphanumeric Sender IDs are supported. For Network MTN (62001) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Germany",
    "MCC": "262",
    "Dial Code": "49",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Germany: SMS Guidelines Germany: SMS Guidelines MCC: 262 Dial Code: 49 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Georgia",
    "MCC": "282",
    "Dial Code": "995",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Georgia: SMS Guidelines Georgia: SMS Guidelines MCC: 282 Dial Code: 995 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gambia",
    "MCC": "628",
    "Dial Code": "241",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gambia: SMS Guidelines MCC: 628 Dial Code: 241 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gabon",
    "MCC": "628",
    "Dial Code": "241",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gabon: SMS Guidelines Gabon: SMS Guidelines MCC: 628 Dial Code: 241 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "French Polynesia",
    "MCC": "547",
    "Dial Code": "689",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "French Polynesia: SMS Guidelines French Polynesia: SMS Guidelines MCC: 547 Dial Code: 689 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "French Guyana",
    "MCC": "742",
    "Dial Code": "594",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "French Guyana: SMS Guidelines French Guyana: SMS Guidelines MCC: 742 Dial Code: 594 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Fiji",
    "MCC": "542",
    "Dial Code": "679",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Fiji: SMS Guidelines MCC: 542 Dial Code: 679 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Faroe Islands",
    "MCC": "288",
    "Dial Code": "298",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Faroe Islands: SMS Guidelines Faroe Islands: SMS Guidelines MCC: 288 Dial Code: 298 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Falkland Islands",
    "MCC": "750",
    "Dial Code": "500",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Falkland Islands: SMS Guidelines Falkland Islands: SMS Guidelines MCC: 750 Dial Code: 500 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ethiopia",
    "MCC": "636",
    "Dial Code": "251",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Ethiopia: SMS Guidelines Ethiopia: SMS Guidelines MCC: 636 Dial Code: 251 Alphanumeric Sender IDs are supported. For Network MTN (63601) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. Sending traffic related to local Banking or Promotional traffic is not allowed Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Eritrea",
    "MCC": "657",
    "Dial Code": "291",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Eritrea: SMS Guidelines MCC: 657 Dial Code: 291 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Equatorial Guinea",
    "MCC": "627",
    "Dial Code": "240",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Equatorial Guinea: SMS Guidelines Equatorial Guinea: SMS Guidelines MCC: 627 Dial Code: 240 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Egypt",
    "MCC": "602",
    "Dial Code": "20",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Egypt: SMS Guidelines Egypt: SMS Guidelines MCC: 602 Dial Code: 20 Alphanumeric Sender IDs are supported. For network Etisalat (60203), Alphanumeric Senders are only supported through registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Dominican Republic",
    "MCC": "370",
    "Dial Code": "1809",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Dominican Republic: SMS Guidelines Dominican Republic: SMS Guidelines MCC: 370 Dial Code: 1809 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Dominica",
    "MCC": "366",
    "Dial Code": "1767",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Dominica: SMS Guidelines Dominica: SMS Guidelines MCC: 366 Dial Code: 1767 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Djibouti",
    "MCC": "253",
    "Dial Code": "638",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Djibouti: SMS Guidelines Djibouti: SMS Guidelines MCC: 253 Dial Code: 638 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cyprus",
    "MCC": "357",
    "Dial Code": "280",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cyprus: SMS Guidelines Cyprus: SMS Guidelines MCC: 357 Dial Code: 280 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cuba",
    "MCC": "368",
    "Dial Code": "53",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Cuba: SMS Guidelines Cuba: SMS Guidelines MCC: 368 Dial Code: 53 Alphanumeric Sender IDs are supported with registration. Alpha numeric Sender ID registration is required. Senders composed of a combination of letters and numbers are not supported. Provision times for Alphanumeric Registration up to 6 months. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cote d'Ivoire",
    "MCC": "612",
    "Dial Code": "225",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Cote d'Ivoire: SMS Guidelines Cote d'Ivoire: SMS Guidelines MCC: 612 Dial Code: 225 Alphanumeric Sender IDs are supported. For Network MTN (61205) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cook Islands",
    "MCC": "682",
    "Dial Code": "548",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cook Islands: SMS Guidelines MCC: 682 Dial Code: 548 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Democratic Republic of the Congo",
    "MCC": "243",
    "Dial Code": "630",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Democratic Republic of the Congo: SMS Guidelines Democratic Republic of the Congo: SMS Guidelines MCC: 243 Dial Code: 630 Alphanumeric Sender IDs are supported. For Network Vodacom (63001) Alphanumeric Sender IDs are only supported with registration. Outside of this network, Alphanumeric Sender IDs can be replaced by Generic Alpha Sender ID or random Short Code. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Congo",
    "MCC": "629",
    "Dial Code": "242",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Congo: SMS Guidelines MCC: 629 Dial Code: 242 Alphanumeric Sender IDs are supported. For Network MTN (62910) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Comoros",
    "MCC": "654",
    "Dial Code": "269",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Comoros: SMS Guidelines Comoros: SMS Guidelines MCC: 654 Dial Code: 269 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "China",
    "MCC": "460",
    "Dial Code": "86",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "China: SMS Guidelines MCC: 460 Dial Code: 86 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. All message content has to be whitelisted by local operators. It is highly advise to pre-register message content templates. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on content whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Chad",
    "MCC": "622",
    "Dial Code": "235",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Chad: SMS Guidelines MCC: 622 Dial Code: 235 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Central African Republic",
    "MCC": "623",
    "Dial Code": "236",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Central African Republic: SMS Guidelines Central African Republic: SMS Guidelines MCC: 623 Dial Code: 236 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cayman Islands",
    "MCC": "346",
    "Dial Code": "1345",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cayman Islands: SMS Guidelines Cayman Islands: SMS Guidelines MCC: 346 Dial Code: 1345 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cape Verde",
    "MCC": "625",
    "Dial Code": "238",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cape Verde: SMS Guidelines MCC: 625 Dial Code: 238 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cameroon",
    "MCC": "624",
    "Dial Code": "237",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Cameroon: SMS Guidelines Cameroon: SMS Guidelines MCC: 624 Dial Code: 237 Alphanumeric Sender IDs are supported. For Network MTN (62401) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cambodia",
    "MCC": "456",
    "Dial Code": "855",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cambodia: SMS Guidelines Cambodia: SMS Guidelines MCC: 456 Dial Code: 855 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Burundi",
    "MCC": "642",
    "Dial Code": "257",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Burundi: SMS Guidelines MCC: 642 Dial Code: 257 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Burkina Faso",
    "MCC": "613",
    "Dial Code": "226",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Burkina Faso: SMS Guidelines Burkina Faso: SMS Guidelines MCC: 613 Dial Code: 226 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Brunei Darussalam",
    "MCC": "528",
    "Dial Code": "673",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Brunei Darussalam: SMS Guidelines Brunei Darussalam: SMS Guidelines MCC: 528 Dial Code: 673 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Botswana",
    "MCC": "652",
    "Dial Code": "267",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Botswana: SMS Guidelines Botswana: SMS Guidelines MCC: 652 Dial Code: 267 Alphanumeric Sender IDs are supported. Registration is not possible. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bosnia and Herzegovina",
    "MCC": "218",
    "Dial Code": "387",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bosnia and Herzegovina: SMS Guidelines Bosnia and Herzegovina: SMS Guidelines MCC: 218 Dial Code: 387 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bhutan",
    "MCC": "402",
    "Dial Code": "975",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bhutan: SMS Guidelines Bhutan: SMS Guidelines MCC: 402 Dial Code: 975 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bermuda",
    "MCC": "350",
    "Dial Code": "1441",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bermuda: SMS Guidelines Bermuda: SMS Guidelines MCC: 350 Dial Code: 1441 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Benin",
    "MCC": "616",
    "Dial Code": "229",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Benin: SMS Guidelines Benin: SMS Guidelines MCC: 616 Dial Code: 229 Alphanumeric Sender IDs are supported. For Network MTN (61603) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Barbados",
    "MCC": "342",
    "Dial Code": "1246",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Barbados: SMS Guidelines Barbados: SMS Guidelines MCC: 342 Dial Code: 1246 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bangladesh",
    "MCC": "470",
    "Dial Code": "880",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bangladesh: SMS Guidelines MCC: 470 Dial Code: 880 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bahrain",
    "MCC": "426",
    "Dial Code": "973",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bahrain: SMS Guidelines Bahrain: SMS Guidelines MCC: 426 Dial Code: 973 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Adult, political and religious content will be blocked by local operators Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bahamas",
    "MCC": "364",
    "Dial Code": "1242",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Bahamas: SMS Guidelines Bahamas: SMS Guidelines MCC: 364 Dial Code: 1242 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Azerbaijan",
    "MCC": "400",
    "Dial Code": "994",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Azerbaijan: SMS Guidelines Azerbaijan: SMS Guidelines MCC: 400 Dial Code: 994 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Aruba",
    "MCC": "363",
    "Dial Code": "297",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Aruba: SMS Guidelines Aruba: SMS Guidelines MCC: 363 Dial Code: 297 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Armenia",
    "MCC": "374",
    "Dial Code": "283",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Armenia: SMS Guidelines Armenia: SMS Guidelines MCC: 374 Dial Code: 283 Alphanumeric Sender IDs are supported with registration. Alpha numeric Sender ID registration is required. Without registration Alpha Sender IDs will be overwritten to a generic Alpha Sender ID, or rejected. Alpha Sender ID registration is advised. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Antigua y Barbuda",
    "MCC": "344",
    "Dial Code": "1268",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Antigua y Barbuda: SMS Guidelines Antigua y Barbuda: SMS Guidelines MCC: 344 Dial Code: 1268 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Anguila",
    "MCC": "365",
    "Dial Code": "1264",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Anguila: SMS Guidelines Anguila: SMS Guidelines MCC: 365 Dial Code: 1264 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Angola",
    "MCC": "631",
    "Dial Code": "244",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Angola: SMS Guidelines Angola: SMS Guidelines MCC : 631 Dial Code : 244 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "American Samoa",
    "MCC": "311",
    "Dial Code": "684",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "American Samoa: SMS Guidelines MCC : 311 - 544 Dial Code : 684 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Algeria",
    "MCC": "603",
    "Dial Code": "213",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Algeria: SMS Guidelines Algeria: SMS Guidelines MCC: 603 Dial Code: 213 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Afghanistan",
    "MCC": "412",
    "Dial Code": "93",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Afghanistan: SMS Guidelines Afghanistan: SMS Guidelines MCC: 412 Dial Code: 93 Alphanumeric Sender IDs are supported. For Network MTN (41240) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Suriname",
    "MCC": "746",
    "Dial Code": "597",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Suriname: SMS Guidelines MCC: 746 Dial Code: 597 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iraq",
    "MCC": "418",
    "Dial Code": "964",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Iraq: SMS Guidelines MCC: 418 Dial Code: 964 Alphanumeric Sender IDs are supported. Registration is not possible. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nicaragua",
    "MCC": "710",
    "Dial Code": "505",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Nicaragua: SMS Guidelines Nicaragua: SMS Guidelines MCC: 710 Dial Code: 505 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Honduras",
    "MCC": "708",
    "Dial Code": "504",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Honduras: SMS Guidelines Honduras: SMS Guidelines MCC: 708 Dial Code: 504 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "El Salvador",
    "MCC": "706",
    "Dial Code": "503",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "El Salvador: SMS Guidelines El Salvador: SMS Guidelines MCC: 706 Dial Code: 503 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Belize",
    "MCC": "702",
    "Dial Code": "501",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Belize: SMS Guidelines Belize: SMS Guidelines MCC: 702 Dial Code: 501 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guatemala",
    "MCC": "704",
    "Dial Code": "502",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Guatemala: SMS Guidelines Guatemala: SMS Guidelines MCC: 704 Dial Code: 502 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Panama",
    "MCC": "714",
    "Dial Code": "507",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Panama: SMS Guidelines Panama: SMS Guidelines MCC : 714 Dial Code: 507 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Venezuela",
    "MCC": "734",
    "Dial Code": "58",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Venezuela: SMS Guidelines Venezuela: SMS Guidelines MCC : 734 Dial Code: 58 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Except for Network Movilnet (73406), Alpha Sender IDs will be maintained and deliver dynamically to this network. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ecuador",
    "MCC": "740",
    "Dial Code": "593",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Ecuador: SMS Guidelines MCC: 740 Dial Code: 593 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Except for Network CNT (74002), Alpha Sender IDs will be maintained and deliver dynamically to this network. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Chile",
    "MCC": "730",
    "Dial Code": "56",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Chile: SMS Guidelines Chile: SMS Guidelines MCC: 730 Dial Code: 56 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Paraguay",
    "MCC": "744",
    "Dial Code": "595",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Paraguay: SMS Guidelines Paraguay: SMS Guidelines MCC: 744 Dial Code: 595 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Uruguay",
    "MCC": "748",
    "Dial Code": "598",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Uruguay: SMS Guidelines Uruguay: SMS Guidelines MCC: 748 Dial Code: 598 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Peru",
    "MCC": "716",
    "Dial Code": "51",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Peru: SMS Guidelines MCC: 716 Dial Code: 51 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bolivia",
    "MCC": "736",
    "Dial Code": "591",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Bolivia: SMS Guidelines Bolivia: SMS Guidelines MCC: 736 Dial Code: 591 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Costa Rica",
    "MCC": "712",
    "Dial Code": "506",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Costa Rica: SMS Guidelines Costa Rica: SMS Guidelines MCC: 712 Dial Code: 506 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Argentina",
    "MCC": "722",
    "Dial Code": "53",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Argentina: SMS Guidelines Argentina: SMS Guidelines MCC: 722 Dial Code: 53 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turkey",
    "MCC": "286",
    "Dial Code": "90",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Turkey: SMS Guidelines Turkey: SMS Guidelines MCC: 286 Dial Code: 90 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Gambling traffic is not allowed towards Turkey. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Moldova",
    "MCC": "259",
    "Dial Code": "373",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Moldova: SMS Guidelines Moldova: SMS Guidelines MCC: 259 Dial Code: 373 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Luxembourg",
    "MCC": "270",
    "Dial Code": "352",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Luxembourg: SMS Guidelines Luxembourg: SMS Guidelines MCC: 270 Dial Code: 352 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ukraine",
    "MCC": "255",
    "Dial Code": "380",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Ukraine: SMS Guidelines Ukraine: SMS Guidelines MCC: 255 Dial Code: 380 Due to the ongoing situation, SMS delivery towards Ukraine is to be considered as best-effort. Alphanumeric Sender IDs are partially supported. Registration is not possible. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Andorra",
    "MCC": "213",
    "Dial Code": "376",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Andorra: SMS Guidelines Andorra: SMS Guidelines MCC: 213 Dial Code: 376 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Albania",
    "MCC": "276",
    "Dial Code": "355",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Albania: SMS Guidelines Albania: SMS Guidelines MCC: 276 Dial Code : 355 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bulgaria",
    "MCC": "284",
    "Dial Code": "359",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Bulgaria: SMS Guidelines MCC: 284 Dial Code: 359 Alphanumeric Sender IDs are partially supported. Registration is not possible. Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Croatia",
    "MCC": "219",
    "Dial Code": "385",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Croatia: SMS Guidelines Croatia: SMS Guidelines MCC: 219 Dial Code: 385 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Greece",
    "MCC": "202",
    "Dial Code": "30",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Greece: SMS Guidelines MCC: 202 Dial Code: 30 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Romania",
    "MCC": "226",
    "Dial Code": "40",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Romania: SMS Guidelines Romania: SMS Guidelines MCC: 226 Dial Code: 40 Alphanumeric Sender IDs are supported with registration. Without registration, Alpha Sender IDs will be overwritten to either Short Code or Generic Alpha. Alpha Senders should be registered to ensure delivery of same Alpha Sender Messages containing URLs as part of the content can be blocked by local operators. URL whitelisting is possible. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Czech Republic (Czechia)",
    "MCC": "230",
    "Dial Code": "420",
    "Alphanumeric": "Alphanumeric Sender IDs might be overwritten to either Generic Alphanumeric or Numeric Sender ID",
    "combined_text": "Czech Republic (Czechia): : SMS Guidelines Czech Republic (Czechia): : SMS Guidelines MCC: 230 Dial Code: 420 Alpha Sender ID registration is required for Network T-Mobile (23001). Outside of this network, Alphanumeric Sender IDs might be overwritten to either Generic Alphanumeric or Numeric Sender ID. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Hungary",
    "MCC": "216",
    "Dial Code": "36",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Hungary: SMS Guidelines MCC : 216 Dial Code : 36 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Slovenia",
    "MCC": "293",
    "Dial Code": "386",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Slovenia: SMS Guidelines Slovenia: SMS Guidelines MCC : 293 Dial Code: 386 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Switzerland",
    "MCC": "228",
    "Dial Code": "41",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Switzerland: SMS Guidelines Switzerland: SMS Guidelines MCC: 228 Dial Code: 41 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Latvia",
    "MCC": "247",
    "Dial Code": "371",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Latvia: SMS Guidelines Latvia: SMS Guidelines MCC: 247 Dial Code: 371 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Lithuania",
    "MCC": "246",
    "Dial Code": "370",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lithuania: SMS Guidelines MCC: 246 Dial Code : 370 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Estonia",
    "MCC": "248",
    "Dial Code": "372",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Estonia: SMS Guidelines Estonia: SMS Guidelines MCC: 248 Dial Code: 372 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iceland",
    "MCC": "274",
    "Dial Code": "354",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Iceland: SMS Guidelines Iceland: SMS Guidelines MCC : 274 Dial Code: 354 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Finland",
    "MCC": "244",
    "Dial Code": "358",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Finland: SMS Guidelines MCC: 244 Dial Code: 358 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Norway",
    "MCC": "242",
    "Dial Code": "47",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Norway: SMS Guidelines MCC: 242 Dial Code: 47 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sweden",
    "MCC": "240",
    "Dial Code": "46",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sweden: SMS Guidelines Sweden: SMS Guidelines MCC: 240 Dial Code: 46 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Denmark",
    "MCC": "238",
    "Dial Code": "45",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Denmark: SMS Guidelines Denmark: SMS Guidelines MCC: 238 Dial Code: 45 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Austria",
    "MCC": "232",
    "Dial Code": "43",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Austria: SMS Guidelines Austria: SMS Guidelines MCC : 232 Dial Code: 43 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "South Africa",
    "MCC": "655",
    "Dial Code": "27",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "South Africa: SMS Guidelines South Africa: SMS Guidelines MCC : 655 Dial Code : 27 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to random Local Long Code. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Poland",
    "MCC": "260",
    "Dial Code": "48",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Poland: SMS Guidelines MCC: 260 Dial Code: 48 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ireland",
    "MCC": "272",
    "Dial Code": "353",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Ireland: SMS Guidelines Ireland: SMS Guidelines MCC: 272 Dial Code: 353 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Spain",
    "MCC": "214",
    "Dial Code": "34",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Spain: SMS Guidelines Spain: SMS Guidelines MCC: 214 Dial Code: 34 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Portugal",
    "MCC": "268",
    "Dial Code": "351",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Portugal: SMS Guidelines MCC: 268 Dial Code: 351 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Serbia",
    "MCC": "220",
    "Dial Code": "381",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Serbia: SMS Guidelines Serbia: SMS Guidelines MCC: 220 Dial Code: 381 Alphanumeric Sender IDs are supported with registration. Registration is possible to ensure Alphanumeric Senders can be maintained. Without registration, Alpha Senders will be overwritten to Generic Alpha Sender IDs. The registration of Alphanumeric Senders involves monthly fees. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Republic of Korea (South Korea)",
    "MCC": "450",
    "Dial Code": "82",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Republic of Korea (South Korea): SMS Guidelines Republic of Korea (South Korea): SMS Guidelines MCC: 450 Dial Code: 82 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Local Long Code to ensure delivery. All messages to this destination will have the following text added by default: [Web ë°śě‹ ] : This indicates A2P traffic [ęµ­ě śë°śě‹ ]: This indicates that the message has been sent from abroad Gambling and Adult content is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kiribati",
    "MCC": "545",
    "Dial Code": "686",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kiribati: SMS Guidelines Kiribati: SMS Guidelines MCC: 545 Dial Code: 686 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Zimbabwe",
    "MCC": "648",
    "Dial Code": "263",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Zimbabwe: SMS Guidelines Zimbabwe: SMS Guidelines MCC: 648 Dial Code: 263 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Zambia",
    "MCC": "645",
    "Dial Code": "260",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Zambia: SMS Guidelines Zambia: SMS Guidelines MCC: 645 Dial Code: 260 Alphanumeric Sender IDs are supported. For Network MTN (65402) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Yemen",
    "MCC": "421",
    "Dial Code": "998",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Yemen: SMS Guidelines MCC: 421 Dial Code: 998 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Virgin Islands (British)",
    "MCC": "348",
    "Dial Code": "1340",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Virgin Islands (British): SMS Guidelines Virgin Islands (British): SMS Guidelines MCC: 348 Dial Code: 1340 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Vietnam",
    "MCC": "452",
    "Dial Code": "84",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Vietnam: SMS Guidelines Vietnam: SMS Guidelines MCC: 452 Dial Code: 84 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Vietnam is a destination that supports SMSC-DLR only, as such positive DLRs are to be expected. Handset delivery reports are not possible. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Vanuatu",
    "MCC": "541",
    "Dial Code": "678",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Vanuatu: SMS Guidelines Vanuatu: SMS Guidelines MCC: 541 Dial Code: 678 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Uzbekistan",
    "MCC": "434",
    "Dial Code": "998",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Uzbekistan: SMS Guidelines Uzbekistan: SMS Guidelines MCC: 434 Dial Code: 998 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "United Arab Emirates",
    "MCC": "424",
    "Dial Code": "971",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "United Arab Emirates: SMS Guidelines United Arab Emirates: SMS Guidelines MCC: 424 Dial Code: 971 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. For promotional traffic, the suffix \"AD\" must be added to the Alphanumeric Sender for traffic distinction. Promotional traffic is not allowed between 09: 00 pm and 07: 00 local time, all traffic submitted during this time window will be queued and delivery will be attempted outside the time period. Religious, gambling political or adult traffic is prohibited. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Uganda",
    "MCC": "641",
    "Dial Code": "256",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Uganda: SMS Guidelines MCC: 641 Dial Code: 256 Alphanumeric Sender IDs are supported. For Network MTN (64110) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tuvalu",
    "MCC": "553",
    "Dial Code": "688",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tuvalu: SMS Guidelines Tuvalu: SMS Guidelines MCC: 553 Dial Code: 688 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turks and Caicos Islands",
    "MCC": "376",
    "Dial Code": "1649",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Turks and Caicos Islands: SMS Guidelines MCC: 376 Dial Code: 1649 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turkmenistan",
    "MCC": "438",
    "Dial Code": "993",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Turkmenistan: SMS Guidelines MCC: 438 Dial Code: 993 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Long Code or Generic Alphanumeric Sender ID to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Tunisia",
    "MCC": "605",
    "Dial Code": "216",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tunisia: SMS Guidelines Tunisia: SMS Guidelines MCC: 605 Dial Code: 216 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Trinidad & Tobago",
    "MCC": "374",
    "Dial Code": "1868",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Trinidad & Tobago: SMS Guidelines Trinidad & Tobago: SMS Guidelines MCC: 374 Dial Code: 1868 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Long Code to ensure delivery towards Network Bmobile (37412). Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Tonga",
    "MCC": "539",
    "Dial Code": "676",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tonga: SMS Guidelines Tonga: SMS Guidelines MCC: 539 Dial Code: 676 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Togo",
    "MCC": "615",
    "Dial Code": "228",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Togo: SMS Guidelines Togo: SMS Guidelines MCC: 615 Dial Code: 228 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Timor-Leste",
    "MCC": "514",
    "Dial Code": "670",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Timor-Leste: SMS Guidelines Timor-Leste: SMS Guidelines MCC: 514 Dial Code: 670 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Thailand",
    "MCC": "520",
    "Dial Code": "66",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Thailand: SMS Guidelines Thailand: SMS Guidelines MCC: 520 Dial Code: 66 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tanzania",
    "MCC": "640",
    "Dial Code": "255",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Tanzania: SMS Guidelines Tanzania: SMS Guidelines MCC: 640 Dial Code: 255 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Tajikistan",
    "MCC": "436",
    "Dial Code": "992",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Tajikistan: SMS Guidelines Tajikistan: SMS Guidelines MCC: 436 Dial Code: 992 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Taiwan",
    "MCC": "466",
    "Dial Code": "886",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Taiwan: SMS Guidelines Taiwan: SMS Guidelines MCC: 466 Dial Code: 886 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Local Long Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Syria",
    "MCC": "417",
    "Dial Code": "963",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Syria: SMS Guidelines MCC: 417 Dial Code: 963 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Long Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Sudan",
    "MCC": "634",
    "Dial Code": "249",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Sudan: SMS Guidelines Sudan: SMS Guidelines MCC: 634 Dial Code: 249 Alphanumeric Sender IDs are supported. For Network MTN (63402) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sri Lanka",
    "MCC": "413",
    "Dial Code": "94",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Sri Lanka: SMS Guidelines Sri Lanka: SMS Guidelines MCC: 413 Dial Code: 94 Alphanumeric Sender IDs are supported. For Networks Dialog (41302) and Mobitel (41301) Alphanumeric Sender IDs are only supported with registration. Network Mobitel (41301) only allows OTP, transactional traffic. Messages carrying non-OTP traffic will be rejected by the Network. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "South Sudan",
    "MCC": "659",
    "Dial Code": "211",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "South Sudan: SMS Guidelines South Sudan: SMS Guidelines MCC: 659 Dial Code: 211 Alphanumeric Sender IDs are supported. For Network MTN (65902) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Somalia",
    "MCC": "637",
    "Dial Code": "252",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Somalia: SMS Guidelines Somalia: SMS Guidelines MCC: 637 Dial Code: 252 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Solomon Islands",
    "MCC": "540",
    "Dial Code": "677",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Solomon Islands: SMS Guidelines Solomon Islands: SMS Guidelines MCC: 540 Dial Code: 677 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Slovakia",
    "MCC": "231",
    "Dial Code": "421",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Slovakia: SMS Guidelines Slovakia: SMS Guidelines MCC: 231 Dial Code: 421 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Singapore",
    "MCC": "525",
    "Dial Code": "65",
    "Alphanumeric": "Alphanumeric Sender IDs has been implemented by the Infocomm Media Development Authority (IMDA) since January 31st, 2023",
    "combined_text": "Singapore: SMS Guidelines MCC: 525 Dial Code: 65 Mandatory registration of Alphanumeric Sender IDs has been implemented by the Infocomm Media Development Authority (IMDA) since January 31st, 2023. From this date and until July 31st, 2023, all submissions with un-registered Alphanumeric Sender IDs will be flagged and overwritten with \"Likely-SCAM\". After July 31st, 2023, messages with un-registered Alphanumeric Sender IDs will be blocked. Kindly note that the registration of Alphanumeric Senders involves fees. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alphanumeric Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sierra Leone",
    "MCC": "619",
    "Dial Code": "232",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sierra Leone: SMS Guidelines MCC: 619 Dial Code: 232 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Seychelles",
    "MCC": "633",
    "Dial Code": "248",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Seychelles: SMS Guidelines Seychelles: SMS Guidelines MCC: 633 Dial Code: 248 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Senegal",
    "MCC": "608",
    "Dial Code": "221",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Senegal: SMS Guidelines Senegal: SMS Guidelines MCC: 608 Dial Code: 221 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saudi Arabia",
    "MCC": "420",
    "Dial Code": "966",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Saudi Arabia: SMS Guidelines Saudi Arabia: SMS Guidelines MCC: 420 Dial Code: 966 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Registration is only possible for International Brands. For promotional traffic, the suffix \"AD\" must be added to the Alphanumeric Sender for traffic distinction. If message content includes URLs, these must also be whitelisted as part of the Alphanumeric Sender ID registration process. The use of shortened URL links (bit links) is not allowed. Gambling, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sao Tome and Principe",
    "MCC": "626",
    "Dial Code": "239",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sao Tome and Principe: SMS Guidelines Sao Tome and Principe: SMS Guidelines MCC: 626 Dial Code: 239 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "San Marino",
    "MCC": "292",
    "Dial Code": "378",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "San Marino: SMS Guidelines San Marino: SMS Guidelines MCC: 292 Dial Code: 378 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Samoa",
    "MCC": "549",
    "Dial Code": "685",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Samoa: SMS Guidelines Samoa: SMS Guidelines MCC: 549 Dial Code: 685 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Vincent and the Grenadines",
    "MCC": "360",
    "Dial Code": "1784",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Vincent and the Grenadines: SMS Guidelines Saint Vincent and the Grenadines: SMS Guidelines MCC: 360 Dial Code: 1784 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Pierre and Miquelon",
    "MCC": "308",
    "Dial Code": "508",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Pierre and Miquelon: SMS Guidelines Saint Pierre and Miquelon: SMS Guidelines MCC: 308 Dial Code: 508 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Lucia",
    "MCC": "358",
    "Dial Code": "1758",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Lucia: SMS Guidelines Saint Lucia: SMS Guidelines MCC: 358 Dial Code: 1758 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Saint Kitts & Nevis",
    "MCC": "356",
    "Dial Code": "1869",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Saint Kitts & Nevis: SMS Guidelines MCC: 356 Dial Code: 1869 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Rwanda",
    "MCC": "635",
    "Dial Code": "250",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Rwanda: SMS Guidelines Rwanda: SMS Guidelines MCC: 635 Dial Code: 250 Alphanumeric Sender IDs are supported. For Network MTN (63510) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Reunion",
    "MCC": "647",
    "Dial Code": "262",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Reunion: SMS Guidelines Reunion: SMS Guidelines MCC: 647 Dial Code: 262 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Qatar",
    "MCC": "427",
    "Dial Code": "974",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Qatar: SMS Guidelines Qatar: SMS Guidelines MCC: 427 Dial Code: 974 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Papua New Guinea",
    "MCC": "537",
    "Dial Code": "675",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Papua New Guinea: SMS Guidelines Papua New Guinea: SMS Guidelines MCC: 537 Dial Code: 675 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Palestinian Territory",
    "MCC": "425",
    "Dial Code": "970",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Palestinian Territory: SMS Guidelines MCC: 425 Dial Code: 970 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Personal Loans, gambling, adult and cryptocurrency related traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Palau",
    "MCC": "552",
    "Dial Code": "680",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Palau: SMS Guidelines MCC: 552 Dial Code: 680 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Pakistan",
    "MCC": "410",
    "Dial Code": "92",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Pakistan: SMS Guidelines Pakistan: SMS Guidelines MCC: 410 Dial Code: 92 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Gambling related traffic is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Oman",
    "MCC": "422",
    "Dial Code": "968",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Oman: SMS Guidelines Oman: SMS Guidelines MCC: 422 Dial Code: 968 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Non-registered Alpha Sender IDs will either be rejected or overwritten. However this is on best-effort basis. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Norfolk Island",
    "MCC": "505",
    "Dial Code": "672",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Norfolk Island: SMS Guidelines Norfolk Island: SMS Guidelines MCC: 505 Dial Code: 672 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nigeria",
    "MCC": "621",
    "Dial Code": "234",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Nigeria: SMS Guidelines Nigeria: SMS Guidelines MCC: 621 Dial Code: 234 Alphanumeric Sender IDs are supported. For Network MTN (62130) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Niger",
    "MCC": "614",
    "Dial Code": "227",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Niger: SMS Guidelines Niger: SMS Guidelines MCC: 614 Dial Code: 227 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "New Zealand",
    "MCC": "530",
    "Dial Code": "64",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "New Zealand: SMS Guidelines New Zealand: SMS Guidelines MCC: 530 Dial Code: 64 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to a random Short Code to ensure delivery. Due to local restrictions, dedicated short codes are the best way to improve delivery towards this destination. Without a dedicated short code, message delivery is to be considered as best-effort delivery only. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "New Caledonia",
    "MCC": "546",
    "Dial Code": "687",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "New Caledonia: SMS Guidelines New Caledonia: SMS Guidelines MCC: 546 Dial Code: 687 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Netherlands Antilles",
    "MCC": "362",
    "Dial Code": "599",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Netherlands Antilles: SMS Guidelines Netherlands Antilles: SMS Guidelines MCC: 362 Dial Code: 599 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nepal",
    "MCC": "429",
    "Dial Code": "977",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Nepal: SMS Guidelines Nepal: SMS Guidelines Nepal: SMS Guidelines MCC: 429 Dial Code: 977 Alphanumeric Sender IDs are supported. For Network Ncell (42902) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Namibia",
    "MCC": "649",
    "Dial Code": "264",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Namibia: SMS Guidelines MCC: 649 Dial Code: 264 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Occasionally Alphanumeric Sender IDs might be replaced by Generic Alphanumeric Sender ID to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Myanmar",
    "MCC": "414",
    "Dial Code": "95",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Myanmar: SMS Guidelines MCC: 414 Dial Code: 95 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Mozambique",
    "MCC": "643",
    "Dial Code": "258",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Mozambique: SMS Guidelines MCC: 643 Dial Code: 258 Alphanumeric Sender IDs are supported. Occasionally Alpha Sender ID might be replaced by Generic Alpha Sender ID towards Network Movitel (64303) to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Morocco",
    "MCC": "604",
    "Dial Code": "212",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Morocco: SMS Guidelines Morocco: SMS Guidelines MCC: 604 Dial Code: 212 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Montserrat",
    "MCC": "354",
    "Dial Code": "1664",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Montserrat: SMS Guidelines MCC: 354 Dial Code: 1664 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Montenegro",
    "MCC": "297",
    "Dial Code": "382",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Montenegro: SMS Guidelines Montenegro: SMS Guidelines MCC: 297 Dial Code: 382 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mongolia",
    "MCC": "428",
    "Dial Code": "976",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Mongolia: SMS Guidelines MCC: 428 Dial Code: 976 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Monaco",
    "MCC": "212",
    "Dial Code": "377",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Monaco: SMS Guidelines MCC: 212 Dial Code: 377 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mauritius",
    "MCC": "617",
    "Dial Code": "230",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, except towards network Orange Mauritius",
    "combined_text": "Mauritius: SMS Guidelines MCC: 617 Dial Code: 230 Alphanumeric Sender IDs are supported and will be maintained, except towards network Orange Mauritius. No registration is required. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mauritania",
    "MCC": "609",
    "Dial Code": "222",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Mauritania: SMS Guidelines MCC: 609 Dial Code: 222 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Martinique",
    "MCC": "340",
    "Dial Code": "596",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Martinique: SMS Guidelines Martinique: SMS Guidelines MCC: 340 Dial Code: 596 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malta",
    "MCC": "278",
    "Dial Code": "356",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Malta: SMS Guidelines Malta: SMS Guidelines MCC: 278 Dial Code: 356 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mali",
    "MCC": "610",
    "Dial Code": "223",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Mali: SMS Guidelines Mali: SMS Guidelines MCC: 610 Dial Code: 223 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Maldives",
    "MCC": "472",
    "Dial Code": "960",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Maldives: SMS Guidelines Maldives: SMS Guidelines MCC : 472 Dial Code: 960 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malaysia",
    "MCC": "502",
    "Dial Code": "60",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Malaysia: SMS Guidelines Malaysia: SMS Guidelines MCC: 502 Dial Code: 60 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Message content should start with the Header â€śRM0.00 ,â€ť â€śRM0.0 ,â€ť or â€śRM0 â€ś. If this header is not included, it will be added by local operators, this can disrupt total message content length. Additionally, content should include a brand/identifier or company name, without this identifier, operators can filter traffic or impose fines for non-compliant traffic. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Malawi",
    "MCC": "650",
    "Dial Code": "265",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Malawi: SMS Guidelines Malawi: SMS Guidelines MCC: 650 Dial Code: 265 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Madagascar",
    "MCC": "646",
    "Dial Code": "261",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Madagascar: SMS Guidelines MCC: 646 Dial Code: 261 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Macedonia (North Macedonia)",
    "MCC": "294",
    "Dial Code": "389",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Macedonia (North Macedonia): SMS Guidelines Macedonia (North Macedonia): SMS Guidelines MCC: 294 Dial Code: 389 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Occasionally Alphanumeric Sender IDs might be replaced by Generic Alphanumeric Sender ID to ensure delivery. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Macao",
    "MCC": "455",
    "Dial Code": "853",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Macao: SMS Guidelines Macao: SMS Guidelines MCC: 455 Dial Code: 853 Alphanumeric Sender IDs are supported. Registration is not necessary. Alphanumeric Sender IDs can be overwritten to a random Hong Kong Long Code to ensure delivery towards Network China Telecom (45507). There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Liechtenstein",
    "MCC": "295",
    "Dial Code": "423",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Liechtenstein: SMS Guidelines Liechtenstein: SMS Guidelines MCC: 295 Dial Code: 423 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Libya",
    "MCC": "606",
    "Dial Code": "218",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Libya: SMS Guidelines Libya: SMS Guidelines MCC: 606 Dial Code: 218 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Liberia",
    "MCC": "618",
    "Dial Code": "231",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Liberia: SMS Guidelines Liberia: SMS Guidelines MCC: 618 Dial Code: 231 Alphanumeric Sender IDs are supported. For Network Lonestar MTN (61801) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Lesotho",
    "MCC": "651",
    "Dial Code": "266",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lesotho: SMS Guidelines Lesotho: SMS Guidelines MCC: 651 Dial Code: 266 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Lebanon",
    "MCC": "415",
    "Dial Code": "961",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lebanon: SMS Guidelines Lebanon: SMS Guidelines MCC: 415 Dial Code: 961 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Laos PDR",
    "MCC": "457",
    "Dial Code": "856",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Laos PDR: SMS Guidelines MCC: 457 Dial Code: 856 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kyrgyzstan",
    "MCC": "437",
    "Dial Code": "996",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kyrgyzstan: SMS Guidelines MCC: 437 Dial Code: 996 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kuwait",
    "MCC": "419",
    "Dial Code": "965",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kuwait: SMS Guidelines Kuwait: SMS Guidelines MCC: 419 Dial Code: 965 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Adult, religious and political content is not permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Kosovo",
    "MCC": "221",
    "Dial Code": "383",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Kosovo: SMS Guidelines Kosovo: SMS Guidelines MCC: 221 Dial Code: 383 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Kenya",
    "MCC": "639",
    "Dial Code": "254",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kenya: SMS Guidelines Kenya: SMS Guidelines MCC: 639 Dial Code: 254 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Political, Religious, gambling, adult and P2P content is prohibited. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Kazakhstan",
    "MCC": "401",
    "Dial Code": "7",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Kazakhstan: SMS Guidelines Kazakhstan: SMS Guidelines MCC: 401 Dial Code: 7 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Non-registered Alphanumeric Sender IDs will either be rejected or overwritten. However, this is on best-effort basis. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Jordan",
    "MCC": "416",
    "Dial Code": "962",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Jordan: SMS Guidelines Jordan: SMS Guidelines MCC: 416 Dial Code: 962 Alphanumeric Sender IDs are supported. There is a distinction between Local and International traffic. For local traffic, Alphanumeric Sender IDs are only supported through registration. International traffic does not require registration. Alphanumeric Senders will be supported. Promotional traffic can only be sent between 7 A.M. and 9 P.M. local time. Alphanumeric Senders used for promotional traffic must include the prefix \"ADV\". Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Japan",
    "MCC": "440",
    "Dial Code": "81",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Japan: SMS Guidelines Japan: SMS Guidelines MCC: 440 Dial Code: 81 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. SMS containing URLs as part of the message body could be filtered Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Jamaica",
    "MCC": "338",
    "Dial Code": "1876",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Jamaica: SMS Guidelines Jamaica: SMS Guidelines MCC: 338 Dial Code: 1876 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Israel",
    "MCC": "425",
    "Dial Code": "972",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Israel: SMS Guidelines Israel: SMS Guidelines MCC: 425 Dial Code: 972 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Religious, gambling, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iran",
    "MCC": "432",
    "Dial Code": "98",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Iran: SMS Guidelines Iran: SMS Guidelines MCC: 432 Dial Code: 98 Alphanumeric Sender IDs are partially supported. For network Righttel (43220), Alphanumeric Sender IDs are supported and will be maintained Alphanumeric Sender ID registration is required for Network MCI (43211). For the remaining networks Alphanumeric Senders will be overwritten to a random long code to ensure delivery. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Indonesia",
    "MCC": "510",
    "Dial Code": "62",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Indonesia: SMS Guidelines MCC: 510 Dial Code: 62 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Unregistered Alphanumeric Sender IDs can sometimes be overwritten, however this should only be seen as best-effort delivery. There is a distinction between Local and International traffic and processes vary depending on this difference. The use of generic Alphanumeric Sender IDs is not recommended. Alphanumeric Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "India",
    "MCC": "404",
    "Dial Code": "91",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported through registration",
    "combined_text": "India: SMS Guidelines MCC: 404 - 405 Dial Code: 91 Alphanumeric Sender IDs are partially supported through registration. Only Local Alpha Sender IDs (Local Entities) can be registered (DLT registration process) while no registration is possible for International Alpha Sender IDs. International Alphanumeric Sender IDs will be overwritten to random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Hong Kong",
    "MCC": "454",
    "Dial Code": "852",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Hong Kong: SMS Guidelines Hong Kong: SMS Guidelines MCC: 454 Dial Code: 852 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. It is common for handsets in Hong Kong to follow the â€ś2 numbers 1 SIM Cardâ€ť model, with one Chinese number (+86) and one HK number (+85), this can cause delivery issues. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Haiti",
    "MCC": "372",
    "Dial Code": "509",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Haiti: SMS Guidelines Haiti: SMS Guidelines MCC: 372 Dial Code: 509 Alphanumeric Sender IDs are partially supported. Registration is not possible. Alphanumeric Sender IDs are not supported towards Operator Natcom (37203), due to local restrictions, submissions with this type of Sender will be blocked. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guyana",
    "MCC": "738",
    "Dial Code": "592",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Guyana: SMS Guidelines Guyana: SMS Guidelines MCC: 738 Dial Code: 592 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guinea-Bissau",
    "MCC": "632",
    "Dial Code": "245",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Guinea-Bissau: SMS Guidelines Guinea-Bissau: SMS Guidelines MCC: 632 Dial Code: 245 Alphanumeric Sender IDs are supported. For Network MTN (63202) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Guinea",
    "MCC": "611",
    "Dial Code": "224",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Guinea: SMS Guidelines Guinea: SMS Guidelines MCC: 611 Dial Code: 224 Alphanumeric Sender IDs are supported. For Network MTN (61104) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Guam",
    "MCC": "310",
    "Dial Code": "1671",
    "Alphanumeric": "Alphanumeric Sender IDs is not allowed/supported for this destination",
    "combined_text": "Guam: SMS Guidelines Guam: SMS Guidelines MCC: 310 Dial Code: 1671 The use of Alphanumeric Sender IDs is not allowed/supported for this destination. For this destination, only traffic with Long Code is permitted. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guadeloupe",
    "MCC": "340",
    "Dial Code": "590",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Guadeloupe: SMS Guidelines Guadeloupe: SMS Guidelines MCC: 340 Dial Code: 590 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Grenada",
    "MCC": "352",
    "Dial Code": "1473",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Grenada: SMS Guidelines Grenada: SMS Guidelines MCC: 352 Dial Code: 1473 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Greenland",
    "MCC": "290",
    "Dial Code": "299",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Greenland: SMS Guidelines MCC: 290 Dial Code: 299 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gibraltar",
    "MCC": "266",
    "Dial Code": "350",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gibraltar: SMS Guidelines Gibraltar: SMS Guidelines MCC: 266 Dial Code: 350 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ghana",
    "MCC": "620",
    "Dial Code": "233",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Ghana: SMS Guidelines MCC: 620 Dial Code: 233 Alphanumeric Sender IDs are supported. For Network MTN (62001) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Germany",
    "MCC": "262",
    "Dial Code": "49",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Germany: SMS Guidelines Germany: SMS Guidelines MCC: 262 Dial Code: 49 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Georgia",
    "MCC": "282",
    "Dial Code": "995",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Georgia: SMS Guidelines Georgia: SMS Guidelines MCC: 282 Dial Code: 995 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gambia",
    "MCC": "628",
    "Dial Code": "241",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gambia: SMS Guidelines MCC: 628 Dial Code: 241 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Gabon",
    "MCC": "628",
    "Dial Code": "241",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Gabon: SMS Guidelines Gabon: SMS Guidelines MCC: 628 Dial Code: 241 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "French Polynesia",
    "MCC": "547",
    "Dial Code": "689",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "French Polynesia: SMS Guidelines French Polynesia: SMS Guidelines MCC: 547 Dial Code: 689 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "French Guyana",
    "MCC": "742",
    "Dial Code": "594",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "French Guyana: SMS Guidelines French Guyana: SMS Guidelines MCC: 742 Dial Code: 594 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Fiji",
    "MCC": "542",
    "Dial Code": "679",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Fiji: SMS Guidelines MCC: 542 Dial Code: 679 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Faroe Islands",
    "MCC": "288",
    "Dial Code": "298",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Faroe Islands: SMS Guidelines Faroe Islands: SMS Guidelines MCC: 288 Dial Code: 298 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Falkland Islands",
    "MCC": "750",
    "Dial Code": "500",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Falkland Islands: SMS Guidelines Falkland Islands: SMS Guidelines MCC: 750 Dial Code: 500 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ethiopia",
    "MCC": "636",
    "Dial Code": "251",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Ethiopia: SMS Guidelines Ethiopia: SMS Guidelines MCC: 636 Dial Code: 251 Alphanumeric Sender IDs are supported. For Network MTN (63601) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. Sending traffic related to local Banking or Promotional traffic is not allowed Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Eritrea",
    "MCC": "657",
    "Dial Code": "291",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Eritrea: SMS Guidelines MCC: 657 Dial Code: 291 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Religious, political or adult traffic is prohibited. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Equatorial Guinea",
    "MCC": "627",
    "Dial Code": "240",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Equatorial Guinea: SMS Guidelines Equatorial Guinea: SMS Guidelines MCC: 627 Dial Code: 240 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Egypt",
    "MCC": "602",
    "Dial Code": "20",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Egypt: SMS Guidelines Egypt: SMS Guidelines MCC: 602 Dial Code: 20 Alphanumeric Sender IDs are supported. For network Etisalat (60203), Alphanumeric Senders are only supported through registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Dominican Republic",
    "MCC": "370",
    "Dial Code": "1809",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Dominican Republic: SMS Guidelines Dominican Republic: SMS Guidelines MCC: 370 Dial Code: 1809 Alphanumeric Sender IDs are supported. No registration is required. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Dominica",
    "MCC": "366",
    "Dial Code": "1767",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Dominica: SMS Guidelines Dominica: SMS Guidelines MCC: 366 Dial Code: 1767 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Djibouti",
    "MCC": "253",
    "Dial Code": "638",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Djibouti: SMS Guidelines Djibouti: SMS Guidelines MCC: 253 Dial Code: 638 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cyprus",
    "MCC": "357",
    "Dial Code": "280",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cyprus: SMS Guidelines Cyprus: SMS Guidelines MCC: 357 Dial Code: 280 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cuba",
    "MCC": "368",
    "Dial Code": "53",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Cuba: SMS Guidelines Cuba: SMS Guidelines MCC: 368 Dial Code: 53 Alphanumeric Sender IDs are supported with registration. Alpha numeric Sender ID registration is required. Senders composed of a combination of letters and numbers are not supported. Provision times for Alphanumeric Registration up to 6 months. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cote d'Ivoire",
    "MCC": "612",
    "Dial Code": "225",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Cote d'Ivoire: SMS Guidelines Cote d'Ivoire: SMS Guidelines MCC: 612 Dial Code: 225 Alphanumeric Sender IDs are supported. For Network MTN (61205) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cook Islands",
    "MCC": "682",
    "Dial Code": "548",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cook Islands: SMS Guidelines MCC: 682 Dial Code: 548 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Democratic Republic of the Congo",
    "MCC": "243",
    "Dial Code": "630",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Democratic Republic of the Congo: SMS Guidelines Democratic Republic of the Congo: SMS Guidelines MCC: 243 Dial Code: 630 Alphanumeric Sender IDs are supported. For Network Vodacom (63001) Alphanumeric Sender IDs are only supported with registration. Outside of this network, Alphanumeric Sender IDs can be replaced by Generic Alpha Sender ID or random Short Code. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Congo",
    "MCC": "629",
    "Dial Code": "242",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Congo: SMS Guidelines MCC: 629 Dial Code: 242 Alphanumeric Sender IDs are supported. For Network MTN (62910) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Comoros",
    "MCC": "654",
    "Dial Code": "269",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Comoros: SMS Guidelines Comoros: SMS Guidelines MCC: 654 Dial Code: 269 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "China",
    "MCC": "460",
    "Dial Code": "86",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "China: SMS Guidelines MCC: 460 Dial Code: 86 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. All message content has to be whitelisted by local operators. It is highly advise to pre-register message content templates. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on content whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Chad",
    "MCC": "622",
    "Dial Code": "235",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Chad: SMS Guidelines MCC: 622 Dial Code: 235 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Central African Republic",
    "MCC": "623",
    "Dial Code": "236",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Central African Republic: SMS Guidelines Central African Republic: SMS Guidelines MCC: 623 Dial Code: 236 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cayman Islands",
    "MCC": "346",
    "Dial Code": "1345",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cayman Islands: SMS Guidelines Cayman Islands: SMS Guidelines MCC: 346 Dial Code: 1345 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cape Verde",
    "MCC": "625",
    "Dial Code": "238",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cape Verde: SMS Guidelines MCC: 625 Dial Code: 238 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Cameroon",
    "MCC": "624",
    "Dial Code": "237",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Cameroon: SMS Guidelines Cameroon: SMS Guidelines MCC: 624 Dial Code: 237 Alphanumeric Sender IDs are supported. For Network MTN (62401) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Cambodia",
    "MCC": "456",
    "Dial Code": "855",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Cambodia: SMS Guidelines Cambodia: SMS Guidelines MCC: 456 Dial Code: 855 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Burundi",
    "MCC": "642",
    "Dial Code": "257",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Burundi: SMS Guidelines MCC: 642 Dial Code: 257 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Burkina Faso",
    "MCC": "613",
    "Dial Code": "226",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Burkina Faso: SMS Guidelines Burkina Faso: SMS Guidelines MCC: 613 Dial Code: 226 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Brunei Darussalam",
    "MCC": "528",
    "Dial Code": "673",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Brunei Darussalam: SMS Guidelines Brunei Darussalam: SMS Guidelines MCC: 528 Dial Code: 673 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Botswana",
    "MCC": "652",
    "Dial Code": "267",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Botswana: SMS Guidelines Botswana: SMS Guidelines MCC: 652 Dial Code: 267 Alphanumeric Sender IDs are supported. Registration is not possible. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bosnia and Herzegovina",
    "MCC": "218",
    "Dial Code": "387",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bosnia and Herzegovina: SMS Guidelines Bosnia and Herzegovina: SMS Guidelines MCC: 218 Dial Code: 387 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bhutan",
    "MCC": "402",
    "Dial Code": "975",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bhutan: SMS Guidelines Bhutan: SMS Guidelines MCC: 402 Dial Code: 975 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bermuda",
    "MCC": "350",
    "Dial Code": "1441",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bermuda: SMS Guidelines Bermuda: SMS Guidelines MCC: 350 Dial Code: 1441 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Benin",
    "MCC": "616",
    "Dial Code": "229",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Benin: SMS Guidelines Benin: SMS Guidelines MCC: 616 Dial Code: 229 Alphanumeric Sender IDs are supported. For Network MTN (61603) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Barbados",
    "MCC": "342",
    "Dial Code": "1246",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Barbados: SMS Guidelines Barbados: SMS Guidelines MCC: 342 Dial Code: 1246 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bangladesh",
    "MCC": "470",
    "Dial Code": "880",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bangladesh: SMS Guidelines MCC: 470 Dial Code: 880 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bahrain",
    "MCC": "426",
    "Dial Code": "973",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Bahrain: SMS Guidelines Bahrain: SMS Guidelines MCC: 426 Dial Code: 973 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Adult, political and religious content will be blocked by local operators Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bahamas",
    "MCC": "364",
    "Dial Code": "1242",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Bahamas: SMS Guidelines Bahamas: SMS Guidelines MCC: 364 Dial Code: 1242 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Azerbaijan",
    "MCC": "400",
    "Dial Code": "994",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Azerbaijan: SMS Guidelines Azerbaijan: SMS Guidelines MCC: 400 Dial Code: 994 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Aruba",
    "MCC": "363",
    "Dial Code": "297",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Aruba: SMS Guidelines Aruba: SMS Guidelines MCC: 363 Dial Code: 297 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Armenia",
    "MCC": "374",
    "Dial Code": "283",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Armenia: SMS Guidelines Armenia: SMS Guidelines MCC: 374 Dial Code: 283 Alphanumeric Sender IDs are supported with registration. Alpha numeric Sender ID registration is required. Without registration Alpha Sender IDs will be overwritten to a generic Alpha Sender ID, or rejected. Alpha Sender ID registration is advised. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Antigua y Barbuda",
    "MCC": "344",
    "Dial Code": "1268",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Antigua y Barbuda: SMS Guidelines Antigua y Barbuda: SMS Guidelines MCC: 344 Dial Code: 1268 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Anguila",
    "MCC": "365",
    "Dial Code": "1264",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Anguila: SMS Guidelines Anguila: SMS Guidelines MCC: 365 Dial Code: 1264 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Angola",
    "MCC": "631",
    "Dial Code": "244",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Angola: SMS Guidelines Angola: SMS Guidelines MCC : 631 Dial Code : 244 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "American Samoa",
    "MCC": "311",
    "Dial Code": "684",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "American Samoa: SMS Guidelines MCC : 311 - 544 Dial Code : 684 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Algeria",
    "MCC": "603",
    "Dial Code": "213",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Algeria: SMS Guidelines Algeria: SMS Guidelines MCC: 603 Dial Code: 213 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Afghanistan",
    "MCC": "412",
    "Dial Code": "93",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Afghanistan: SMS Guidelines Afghanistan: SMS Guidelines MCC: 412 Dial Code: 93 Alphanumeric Sender IDs are supported. For Network MTN (41240) Alphanumeric Sender IDs are only supported with registration. Without registration to this network, Alpha Senders will be overwritten to Generic Alpha Sender IDs or will NOT deliver. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Suriname",
    "MCC": "746",
    "Dial Code": "597",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Suriname: SMS Guidelines MCC: 746 Dial Code: 597 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iraq",
    "MCC": "418",
    "Dial Code": "964",
    "Alphanumeric": "Alphanumeric Sender IDs are supported",
    "combined_text": "Iraq: SMS Guidelines MCC: 418 Dial Code: 964 Alphanumeric Sender IDs are supported. Registration is not possible. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Nicaragua",
    "MCC": "710",
    "Dial Code": "505",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Nicaragua: SMS Guidelines Nicaragua: SMS Guidelines MCC: 710 Dial Code: 505 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Honduras",
    "MCC": "708",
    "Dial Code": "504",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Honduras: SMS Guidelines Honduras: SMS Guidelines MCC: 708 Dial Code: 504 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "El Salvador",
    "MCC": "706",
    "Dial Code": "503",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "El Salvador: SMS Guidelines El Salvador: SMS Guidelines MCC: 706 Dial Code: 503 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Belize",
    "MCC": "702",
    "Dial Code": "501",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Belize: SMS Guidelines Belize: SMS Guidelines MCC: 702 Dial Code: 501 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Guatemala",
    "MCC": "704",
    "Dial Code": "502",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Guatemala: SMS Guidelines Guatemala: SMS Guidelines MCC: 704 Dial Code: 502 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Panama",
    "MCC": "714",
    "Dial Code": "507",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Panama: SMS Guidelines Panama: SMS Guidelines MCC : 714 Dial Code: 507 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Venezuela",
    "MCC": "734",
    "Dial Code": "58",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Venezuela: SMS Guidelines Venezuela: SMS Guidelines MCC : 734 Dial Code: 58 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Except for Network Movilnet (73406), Alpha Sender IDs will be maintained and deliver dynamically to this network. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ecuador",
    "MCC": "740",
    "Dial Code": "593",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Ecuador: SMS Guidelines MCC: 740 Dial Code: 593 Alphanumeric Sender IDs are partially supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Except for Network CNT (74002), Alpha Sender IDs will be maintained and deliver dynamically to this network. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Chile",
    "MCC": "730",
    "Dial Code": "56",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Chile: SMS Guidelines Chile: SMS Guidelines MCC: 730 Dial Code: 56 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Paraguay",
    "MCC": "744",
    "Dial Code": "595",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Paraguay: SMS Guidelines Paraguay: SMS Guidelines MCC: 744 Dial Code: 595 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Uruguay",
    "MCC": "748",
    "Dial Code": "598",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Uruguay: SMS Guidelines Uruguay: SMS Guidelines MCC: 748 Dial Code: 598 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Peru",
    "MCC": "716",
    "Dial Code": "51",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Peru: SMS Guidelines MCC: 716 Dial Code: 51 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bolivia",
    "MCC": "736",
    "Dial Code": "591",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Bolivia: SMS Guidelines Bolivia: SMS Guidelines MCC: 736 Dial Code: 591 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Costa Rica",
    "MCC": "712",
    "Dial Code": "506",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Costa Rica: SMS Guidelines Costa Rica: SMS Guidelines MCC: 712 Dial Code: 506 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Argentina",
    "MCC": "722",
    "Dial Code": "53",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Argentina: SMS Guidelines Argentina: SMS Guidelines MCC: 722 Dial Code: 53 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Turkey",
    "MCC": "286",
    "Dial Code": "90",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Turkey: SMS Guidelines Turkey: SMS Guidelines MCC: 286 Dial Code: 90 Alphanumeric Sender IDs are supported with registration. Alphanumeric Sender ID registration is required. Gambling traffic is not allowed towards Turkey. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Moldova",
    "MCC": "259",
    "Dial Code": "373",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Moldova: SMS Guidelines Moldova: SMS Guidelines MCC: 259 Dial Code: 373 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Luxembourg",
    "MCC": "270",
    "Dial Code": "352",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Luxembourg: SMS Guidelines Luxembourg: SMS Guidelines MCC: 270 Dial Code: 352 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ukraine",
    "MCC": "255",
    "Dial Code": "380",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Ukraine: SMS Guidelines Ukraine: SMS Guidelines MCC: 255 Dial Code: 380 Due to the ongoing situation, SMS delivery towards Ukraine is to be considered as best-effort. Alphanumeric Sender IDs are partially supported. Registration is not possible. Occasionally Alphanumeric Sender ID might be overwritten to Random Short Code to ensure delivery. The use of generic Alpha Sender IDs is not recommended as these can be rejected or blocked by local Operators. Alphanumeric Sender IDs should be directly related to the message content. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Andorra",
    "MCC": "213",
    "Dial Code": "376",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Andorra: SMS Guidelines Andorra: SMS Guidelines MCC: 213 Dial Code: 376 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Albania",
    "MCC": "276",
    "Dial Code": "355",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Albania: SMS Guidelines Albania: SMS Guidelines MCC: 276 Dial Code : 355 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Bulgaria",
    "MCC": "284",
    "Dial Code": "359",
    "Alphanumeric": "Alphanumeric Sender IDs are partially supported",
    "combined_text": "Bulgaria: SMS Guidelines MCC: 284 Dial Code: 359 Alphanumeric Sender IDs are partially supported. Registration is not possible. Alphanumeric Sender IDs can be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Croatia",
    "MCC": "219",
    "Dial Code": "385",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Croatia: SMS Guidelines Croatia: SMS Guidelines MCC: 219 Dial Code: 385 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Greece",
    "MCC": "202",
    "Dial Code": "30",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Greece: SMS Guidelines MCC: 202 Dial Code: 30 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Romania",
    "MCC": "226",
    "Dial Code": "40",
    "Alphanumeric": "Alphanumeric Sender IDs are supported with registration",
    "combined_text": "Romania: SMS Guidelines Romania: SMS Guidelines MCC: 226 Dial Code: 40 Alphanumeric Sender IDs are supported with registration. Without registration, Alpha Sender IDs will be overwritten to either Short Code or Generic Alpha. Alpha Senders should be registered to ensure delivery of same Alpha Sender Messages containing URLs as part of the content can be blocked by local operators. URL whitelisting is possible. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Czech Republic (Czechia)",
    "MCC": "230",
    "Dial Code": "420",
    "Alphanumeric": "Alphanumeric Sender IDs might be overwritten to either Generic Alphanumeric or Numeric Sender ID",
    "combined_text": "Czech Republic (Czechia): : SMS Guidelines Czech Republic (Czechia): : SMS Guidelines MCC: 230 Dial Code: 420 Alpha Sender ID registration is required for Network T-Mobile (23001). Outside of this network, Alphanumeric Sender IDs might be overwritten to either Generic Alphanumeric or Numeric Sender ID. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Hungary",
    "MCC": "216",
    "Dial Code": "36",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Hungary: SMS Guidelines MCC : 216 Dial Code : 36 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Slovenia",
    "MCC": "293",
    "Dial Code": "386",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Slovenia: SMS Guidelines Slovenia: SMS Guidelines MCC : 293 Dial Code: 386 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Switzerland",
    "MCC": "228",
    "Dial Code": "41",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Switzerland: SMS Guidelines Switzerland: SMS Guidelines MCC: 228 Dial Code: 41 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Latvia",
    "MCC": "247",
    "Dial Code": "371",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Latvia: SMS Guidelines Latvia: SMS Guidelines MCC: 247 Dial Code: 371 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Lithuania",
    "MCC": "246",
    "Dial Code": "370",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Lithuania: SMS Guidelines MCC: 246 Dial Code : 370 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Estonia",
    "MCC": "248",
    "Dial Code": "372",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Estonia: SMS Guidelines Estonia: SMS Guidelines MCC: 248 Dial Code: 372 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Iceland",
    "MCC": "274",
    "Dial Code": "354",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Iceland: SMS Guidelines Iceland: SMS Guidelines MCC : 274 Dial Code: 354 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Finland",
    "MCC": "244",
    "Dial Code": "358",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Finland: SMS Guidelines MCC: 244 Dial Code: 358 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Norway",
    "MCC": "242",
    "Dial Code": "47",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Norway: SMS Guidelines MCC: 242 Dial Code: 47 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Sweden",
    "MCC": "240",
    "Dial Code": "46",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Sweden: SMS Guidelines Sweden: SMS Guidelines MCC: 240 Dial Code: 46 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Denmark",
    "MCC": "238",
    "Dial Code": "45",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Denmark: SMS Guidelines Denmark: SMS Guidelines MCC: 238 Dial Code: 45 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Messages containing URLs as part of their content are filtered by local operators. Valid URLs can be whitelisted to ensure delivery. Lottery and Gambling related traffic is not allowed and will be blocked by local operators. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on URL whitelisting kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Austria",
    "MCC": "232",
    "Dial Code": "43",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Austria: SMS Guidelines Austria: SMS Guidelines MCC : 232 Dial Code: 43 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "South Africa",
    "MCC": "655",
    "Dial Code": "27",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "South Africa: SMS Guidelines South Africa: SMS Guidelines MCC : 655 Dial Code : 27 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to random Local Long Code. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Poland",
    "MCC": "260",
    "Dial Code": "48",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Poland: SMS Guidelines MCC: 260 Dial Code: 48 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. The use of generic Alpha Sender IDs is not recommended. Alpha Senders should be directly related to the message content. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Ireland",
    "MCC": "272",
    "Dial Code": "353",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Ireland: SMS Guidelines Ireland: SMS Guidelines MCC: 272 Dial Code: 353 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Spain",
    "MCC": "214",
    "Dial Code": "34",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Spain: SMS Guidelines Spain: SMS Guidelines MCC: 214 Dial Code: 34 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Portugal",
    "MCC": "268",
    "Dial Code": "351",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Portugal: SMS Guidelines MCC: 268 Dial Code: 351 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Colombia",
    "MCC": "732",
    "Dial Code": "57",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Colombia: SMS Guidelines Colombia: SMS Guidelines MCC: 732 Dial Code: 57 Alphanumeric Sender IDs are not supported. Registration is not possible. Alpha Sender IDs will be overwritten to either a random Local Long Code or Short Code. Commercial or marketing content can only be sent from 8: 00am to 9: 00pm. To send this type of traffic outside of these hours, explicit consent must be provided by the end-user. Opt-out options must always be included. Through the words Salir or Cancelar. Adult content must be only sent to end-users of legal age if previously requested by them. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Italy",
    "MCC": "222",
    "Dial Code": "39",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "Italy: SMS Guidelines Italy: SMS Guidelines MCC: 222 Dial Code: 39 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Brazil",
    "MCC": "724",
    "Dial Code": "55",
    "Alphanumeric": null,
    "combined_text": "Brazil: SMS Guidelines MCC: 724 Dial Code: 55 Alpha Sender IDs will be overwritten to either a random Local Long Code or Short Code. Registration is not possible. Brazil is a destination that supports SMSC-DLR only, as such, positive DLRs are to be expected. Handset delivery reports are not possible. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "United Kingdom",
    "MCC": "234",
    "Dial Code": "44",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "United Kingdom: SMS Guidelines MCC: 234 - 235 Dial Code: 44 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. MEF Registry against potential Spam and Fraud traffic. A group of Alpha Sender IDs are protected under this registry to combat fraud, as such only authorized senders are allowed to send this traffic. LOAs are required for approval. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Philippines",
    "MCC": "515",
    "Dial Code": "63",
    "Alphanumeric": "Alphanumeric Sender IDs must be pre-registered",
    "combined_text": "Philippines: SMS Guidelines Philippines: SMS Guidelines MCC: 515 Dial Code: 63 Alphanumeric Sender IDs must be pre-registered. A Letter of Authorization (LOA) must be provided (Banking, Financial Institutions). In some instances, Alpha Sender IDs will be Overwritten by local operators to optimize delivery despite being registered. The use of Generic Alpha Sender IDs (i.e. Verify, OTP, InfoSMS, etc) for transactional traffic is not allowed. Submissions with generic alpha Sender IDs will be rejected by local operators. Due to high volumes of Spam and Phishing attempts, we highly advise for the use of Branded URLs instead of shortened URLs (i.e. bit.links). Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "Belgium",
    "MCC": "206",
    "Dial Code": "32",
    "Alphanumeric": "Alphanumeric Sender IDs are not supported",
    "combined_text": "Belgium: SMS Guidelines Belgium: SMS Guidelines MCC: 206 Dial Code: 32 Alphanumeric Sender IDs are not supported. Registration is not possible. All Alphanumeric Sender IDs will be overwritten to either a random Local Long Code or Short Code to ensure delivery. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Mexico",
    "MCC": "334",
    "Dial Code": "52",
    "Alphanumeric": null,
    "combined_text": "Mexico: SMS Guidelines Mexico: SMS Guidelines MCC: 334 Dial Code: 52 Submissions with an Alpha Sender ID* will be overwritten to either a local long code or short code. All promotional traffic should always include clear OPT-OUT options. *Implementation of Alpha Sender ID registration for this destination is relatively new. It is not mandatory, however for AlphaDynamic capabilities, agreements in minimum monthly volume (to be confirmed) are required for the Alpha Sender ID to be maintained. Telnyx advises on registration only if volumes can be maintained. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "Australia",
    "MCC": "505",
    "Dial Code": null,
    "Alphanumeric": "Alphanumeric Sender IDs has been implemented by the Australia Communications and Media Authority (ACMA), this, as part of a recent update on their SPAM Act",
    "combined_text": "Australia: SMS Guidelines Australia: SMS Guidelines MCC: 505 Dial code: 61 There are strict measures in place to help combat spam. As such all commercial traffic should be compliant according to the Australian Spam Act 2003 . Mandatory registration of Alphanumeric Sender IDs has been implemented by the Australia Communications and Media Authority (ACMA), this, as part of a recent update on their SPAM Act. Effective May 8th all messages sent with non-registered Alphanumeric Sender IDs will be blocked. Information on Alphanumeric Sender ID registration: - Please complete the attached form and return to alpha_sender_id@telnyx.com , along with a copy of your Business Registration. - Companies must have a valid business case for the requested Alphanumeric Sender ID. If the relationship between your company/brand and the requested Alphanumeric Sender ID is not clear, please provide additional supporting documentation detailing your business case. - In case that the registration is being made on behalf of a customer, a signed LOA (letter of Authorisation) needs to be provided to confirm the legitimacy of the request. Additional recommendations: - Consent (Proof for Opt-in) should be obtained before sending any communications, i.e. Marketing SMS - Traffic should include clear Opt-Out options. Please make sure to always refer to our Acceptable Use Policy for Messaging . For more information on Alpha Sender ID registration kindly reach out to alpha_sender_id@telnyx.com ."
  },
  {
    "title": "France",
    "MCC": "208",
    "Dial Code": "33",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "France: SMS Guidelines France: SMS Guidelines MCC : 208 Dial Code: 33 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. Telnyx advises on the use of Alphanumeric Sender IDs for all A2P traffic towards this destination. When sending towards MVNO NRJ (20826) and Truphone (20812) Alphanumeric Sender IDs will be replaced by either a random local number or a Short Code. Local Operators do not allow marketing/promotional traffic to be sent on Sundays and French Public Holidays, between 10 pm and 8 am. Any messages attempted during this time will be queued and delivery will be attempted afterwards. All marketing/promotional traffic should include a clear option to opt-out as part of the message content. Fragment STOP au 36179 must be added at the end of the message. If missing, this will be added automatically. Anti-Phishing measures: In an attempt to fight the increase in SMS Phishing and Fraud attempts, French operators have implemented an additional check (Whitelisting) on a group of Alpha Numeric Sender IDs. Traffic using the aforementioned Alphanumeric Sender IDs will only be possible through the submission of a duly signed Letter of Authorization. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  },
  {
    "title": "The Netherlands",
    "MCC": "204",
    "Dial Code": "31",
    "Alphanumeric": "Alphanumeric Sender IDs are supported and will be maintained, no registration is required",
    "combined_text": "The Netherlands: SMS Guidelines The Netherlands: SMS Guidelines MCC: 204 Dial Code: 31 Alphanumeric Sender IDs are supported and will be maintained, no registration is required. There are no restrictions with regards to content towards this destination. Please make sure to always refer to our Acceptable Use Policy for Messaging ."
  }
]